<?php
    // PHPの基礎復習

    // 変数
    // ①$name変数を定義し、自分のフルネームを値として代入
    // ②$nameの値をブラウザに表示

    // if文
    // ③上記$nameの値は空じゃなければ、ブラウザ上に「$nameさんは出席」と表示される分岐文を作成

    // switch文 (サイコロ)
    // ④$num変数を定義し、1 ~ 6のうち任意の数字を値として代入
    // ⑤$numを条件としたswitch文を作成し、$numに入っているデータによってブラウザに表示される文章を変える

    // while文
    // ⑥1から100までの数字をブラウザに出力する
    // ひとつの数字のあとに必ず改行処理を含めること

    // for文
    // ⑦1から100までの数字をブラウザに出力
    // ただし、3の倍数のときは数字ではなくNextを、
    // 5の倍数のときは数字ではなくSeedを表示、
    // 3と5の公倍数の場合はNexSeedと表示する
    // ひとつの数字、文字のあとに必ず改行処理を含めること

    // 配列
    // ⑧学習メンバー全員のフルネームが入った$member配列を定義
    // ⑨$member配列のデータを全件ブラウザに表示 (ひとりひとり改行必須)
      // ※繰り返し文は使わずひとつひとつ要素を指定して表示すること

    // 連想配列
    // ⑩自己紹介用の情報を入れた$profile連想配列を定義
      // キー : 値の入力データ
        // キー : 値
        // name : 自身のフルネーム
        // email : 自身のメールアドレス
        // gender : 自身の性別
        // age : 自身の年齢
    // ⑪$profile連想配列のデータを全件ブラウザに表示 (項目ごと改行必須)
      // ※繰り返し文は使わずひとつひとつ要素を指定して表示すること

    // foreach
    // ⑫$memberの情報をforeach文を使って上記と同じく表示
    // ⑬$profileの情報をforeach文を使って上記と同じく表示
?>
